preset = {
	'ip君(v0)': {
		desc: "一个典型的v0，好友数量非常有限，所以每天能收到的体力也很少。每天赚的金币和星光币勉强够糊口，从来不浪幻阁，运气一般。"
		 		+ "ip君之所以选择保持v0是为了'锻炼自己面对浪钻诱惑时的自制力'，深层次的原因却没有多少人知道。",
		generate: {
			'金币': 104151,
		  '星光币': 47,
		  '体力': 450,
		  '水晶鞋': 1
		},
		princessExtra: 0,
		princessRate: 3, // 3 out of 1
		maidenRate: 5,
	},
	'暖暖(v5)': {
		desc: "很多人充着月卡不知不觉就到了这个等级，除了多了点钻似乎也没有好处，更惨的是很可能从此走上了浪幻阁的不归路，把送来的钻又全部还了回去。。。"
				+ "",
		generate: {
			'金币': 111851,
		  '星光币': 50,
		  '体力': 506,
		  '水晶鞋': 2
		},
		princessExtra: 0,
		princessRate: 3, // 3 out of 1
		maidenRate: 5,
	},
	'玉人(v7)': {
		desc: "女人么，管不住自己的手喜欢买买买也是很正常的，估计过几个月就该v10了。虽然是v7，但是行为模式和v0也没啥区别，真不知道这么多级别是不是白涨了。"
		 		+ "鉴于玉人351次才抽满了昼夜，所以她的脸一定很黑（请注意这个角色的公主掉率被故意调低了）",
		generate: {
			'金币': 117440,
		  '星光币': 61,
		  '体力': 512,
		  '水晶鞋': 2
		},
		princessExtra: 0,
		princessRate: 4, // 4 out of 1
		maidenRate: 5,
	},
	'大喵(v10)': {
		desc: "能用钱解决的问题都不是问题，遇到想要的衣服就把能买的都买满吧。只是不知道运营对v10的态度对不对得起他们花的这些钱。（这个角色假设买满了所有资源，如果你是个节俭的v10请适当调低各项资源。）"
				+ "说起来，从环游世界开始我就一直有个疑问，大喵那数不尽的私房钱是从哪里来的？",
		generate: {
			'金币': 580512,
		  '星光币': 220,
		  '体力': 1285,
		  '水晶鞋': 31
		},
		princessExtra: 25,
		princessRate: 3, // 3 out of 1
		maidenRate: 5,
	}


















};